app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @book_id = Book.find(params[:id])

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ddd"], ["body", "ddd"], ["user_id", 5], ["created_at", "2019-11-19 07:42:07.441589"], ["updated_at", "2019-11-19 07:42:07.441589"]]
---
  def create
  	@book = Book.new(book_params)
  	@books = Book.all
  	@book.user_id = current_user.id
  	@user = current_user
  	if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "sss"], ["body", "sssss"], ["updated_at", "2019-11-21 07:05:29.614984"], ["id", 35]]
---
  def update
    @book = Book.find(params[:id])
    @book_id = Book.find(params[:id])
    @user = @book_id.user
    if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def correct_user
    @book_id = Book.find(params[:id])